phy_test/Mysql_test_result/net_optane_neonsan/test_1000w/oltp_insert_16_1000w.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 512
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 512 tps: 40701.24 qps: 40701.24 (r/w/o: 0.00/40701.24/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 512 tps: 37185.95 qps: 37185.95 (r/w/o: 0.00/37185.95/0.00) lat (ms,95%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 512 tps: 35317.33 qps: 35317.33 (r/w/o: 0.00/35317.33/0.00) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 512 tps: 32802.19 qps: 32802.19 (r/w/o: 0.00/32802.19/0.00) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 512 tps: 31907.70 qps: 31907.70 (r/w/o: 0.00/31907.70/0.00) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 512 tps: 30111.53 qps: 30111.53 (r/w/o: 0.00/30111.53/0.00) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 512 tps: 27300.81 qps: 27300.81 (r/w/o: 0.00/27300.81/0.00) lat (ms,95%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 512 tps: 27753.22 qps: 27753.22 (r/w/o: 0.00/27753.22/0.00) lat (ms,95%): 41.85 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 512 tps: 25965.74 qps: 25965.74 (r/w/o: 0.00/25965.74/0.00) lat (ms,95%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 512 tps: 26961.57 qps: 26961.57 (r/w/o: 0.00/26961.57/0.00) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 512 tps: 25682.45 qps: 25682.45 (r/w/o: 0.00/25682.45/0.00) lat (ms,95%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 512 tps: 23531.47 qps: 23531.47 (r/w/o: 0.00/23531.47/0.00) lat (ms,95%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 512 tps: 23094.63 qps: 23094.63 (r/w/o: 0.00/23094.63/0.00) lat (ms,95%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 512 tps: 22267.01 qps: 22267.01 (r/w/o: 0.00/22267.01/0.00) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 512 tps: 23099.02 qps: 23099.02 (r/w/o: 0.00/23099.02/0.00) lat (ms,95%): 57.87 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 512 tps: 20248.23 qps: 20248.23 (r/w/o: 0.00/20248.23/0.00) lat (ms,95%): 69.29 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 512 tps: 20447.32 qps: 20447.32 (r/w/o: 0.00/20447.32/0.00) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 512 tps: 18908.01 qps: 18908.01 (r/w/o: 0.00/18908.01/0.00) lat (ms,95%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 512 tps: 19094.23 qps: 19094.23 (r/w/o: 0.00/19094.23/0.00) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 512 tps: 17690.78 qps: 17690.78 (r/w/o: 0.00/17690.78/0.00) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 512 tps: 18638.86 qps: 18638.86 (r/w/o: 0.00/18638.86/0.00) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 512 tps: 16628.94 qps: 16628.94 (r/w/o: 0.00/16628.94/0.00) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 512 tps: 16639.18 qps: 16639.38 (r/w/o: 0.00/16639.38/0.00) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 512 tps: 17519.78 qps: 17519.58 (r/w/o: 0.00/17519.58/0.00) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 512 tps: 16115.38 qps: 16115.38 (r/w/o: 0.00/16115.38/0.00) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 512 tps: 16858.25 qps: 16858.25 (r/w/o: 0.00/16858.25/0.00) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 135s ] thds: 512 tps: 15279.66 qps: 15279.66 (r/w/o: 0.00/15279.66/0.00) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 512 tps: 16023.59 qps: 16023.59 (r/w/o: 0.00/16023.59/0.00) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 145s ] thds: 512 tps: 14771.78 qps: 14771.78 (r/w/o: 0.00/14771.78/0.00) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 512 tps: 15216.08 qps: 15216.08 (r/w/o: 0.00/15216.08/0.00) lat (ms,95%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 155s ] thds: 512 tps: 15395.40 qps: 15395.40 (r/w/o: 0.00/15395.40/0.00) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 512 tps: 15153.12 qps: 15153.12 (r/w/o: 0.00/15153.12/0.00) lat (ms,95%): 95.81 err/s: 0.00 reconn/s: 0.00
[ 165s ] thds: 512 tps: 14806.76 qps: 14806.76 (r/w/o: 0.00/14806.76/0.00) lat (ms,95%): 95.81 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 512 tps: 14675.43 qps: 14675.43 (r/w/o: 0.00/14675.43/0.00) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 175s ] thds: 512 tps: 14646.67 qps: 14646.67 (r/w/o: 0.00/14646.67/0.00) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 512 tps: 13638.65 qps: 13638.65 (r/w/o: 0.00/13638.65/0.00) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 185s ] thds: 512 tps: 13145.60 qps: 13145.60 (r/w/o: 0.00/13145.60/0.00) lat (ms,95%): 110.66 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 512 tps: 13868.34 qps: 13868.34 (r/w/o: 0.00/13868.34/0.00) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 195s ] thds: 512 tps: 14147.43 qps: 14147.43 (r/w/o: 0.00/14147.43/0.00) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 512 tps: 13005.06 qps: 13005.06 (r/w/o: 0.00/13005.06/0.00) lat (ms,95%): 112.67 err/s: 0.00 reconn/s: 0.00
[ 205s ] thds: 512 tps: 13329.40 qps: 13329.40 (r/w/o: 0.00/13329.40/0.00) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 512 tps: 12948.42 qps: 12948.42 (r/w/o: 0.00/12948.42/0.00) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 215s ] thds: 512 tps: 12694.40 qps: 12694.40 (r/w/o: 0.00/12694.40/0.00) lat (ms,95%): 112.67 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 512 tps: 13215.97 qps: 13215.97 (r/w/o: 0.00/13215.97/0.00) lat (ms,95%): 108.68 err/s: 0.00 reconn/s: 0.00
[ 225s ] thds: 512 tps: 12051.11 qps: 12051.11 (r/w/o: 0.00/12051.11/0.00) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 512 tps: 12272.36 qps: 12272.36 (r/w/o: 0.00/12272.36/0.00) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 235s ] thds: 512 tps: 12387.96 qps: 12387.96 (r/w/o: 0.00/12387.96/0.00) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 512 tps: 11942.13 qps: 11942.13 (r/w/o: 0.00/11942.13/0.00) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 245s ] thds: 512 tps: 12380.35 qps: 12380.35 (r/w/o: 0.00/12380.35/0.00) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 512 tps: 12033.39 qps: 12033.39 (r/w/o: 0.00/12033.39/0.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 255s ] thds: 512 tps: 11701.01 qps: 11701.01 (r/w/o: 0.00/11701.01/0.00) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 512 tps: 12243.96 qps: 12243.96 (r/w/o: 0.00/12243.96/0.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 265s ] thds: 512 tps: 11465.93 qps: 11465.93 (r/w/o: 0.00/11465.93/0.00) lat (ms,95%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 512 tps: 11147.26 qps: 11147.26 (r/w/o: 0.00/11147.26/0.00) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 275s ] thds: 512 tps: 11589.56 qps: 11589.56 (r/w/o: 0.00/11589.56/0.00) lat (ms,95%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 512 tps: 11846.19 qps: 11846.19 (r/w/o: 0.00/11846.19/0.00) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 285s ] thds: 512 tps: 10964.42 qps: 10964.42 (r/w/o: 0.00/10964.42/0.00) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 512 tps: 11449.72 qps: 11449.72 (r/w/o: 0.00/11449.72/0.00) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 295s ] thds: 512 tps: 11035.38 qps: 11035.38 (r/w/o: 0.00/11035.38/0.00) lat (ms,95%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 512 tps: 11166.01 qps: 11166.01 (r/w/o: 0.00/11166.01/0.00) lat (ms,95%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 305s ] thds: 512 tps: 11460.58 qps: 11460.58 (r/w/o: 0.00/11460.58/0.00) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 512 tps: 10795.49 qps: 10795.49 (r/w/o: 0.00/10795.49/0.00) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 315s ] thds: 512 tps: 10954.41 qps: 10954.41 (r/w/o: 0.00/10954.41/0.00) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 512 tps: 10961.07 qps: 10961.07 (r/w/o: 0.00/10961.07/0.00) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 325s ] thds: 512 tps: 10385.30 qps: 10385.30 (r/w/o: 0.00/10385.30/0.00) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 512 tps: 11143.39 qps: 11143.39 (r/w/o: 0.00/11143.39/0.00) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 335s ] thds: 512 tps: 10871.26 qps: 10871.26 (r/w/o: 0.00/10871.26/0.00) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 512 tps: 10809.41 qps: 10809.41 (r/w/o: 0.00/10809.41/0.00) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 345s ] thds: 512 tps: 11021.44 qps: 11021.44 (r/w/o: 0.00/11021.44/0.00) lat (ms,95%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 512 tps: 10680.49 qps: 10680.49 (r/w/o: 0.00/10680.49/0.00) lat (ms,95%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 355s ] thds: 512 tps: 10696.89 qps: 10696.89 (r/w/o: 0.00/10696.89/0.00) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 512 tps: 10258.65 qps: 10258.65 (r/w/o: 0.00/10258.65/0.00) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 365s ] thds: 512 tps: 10805.31 qps: 10805.31 (r/w/o: 0.00/10805.31/0.00) lat (ms,95%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 370s ] thds: 512 tps: 11095.43 qps: 11095.43 (r/w/o: 0.00/11095.43/0.00) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 375s ] thds: 512 tps: 9893.81 qps: 9893.81 (r/w/o: 0.00/9893.81/0.00) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 512 tps: 11119.39 qps: 11119.39 (r/w/o: 0.00/11119.39/0.00) lat (ms,95%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 385s ] thds: 512 tps: 10152.60 qps: 10152.60 (r/w/o: 0.00/10152.60/0.00) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 390s ] thds: 512 tps: 10014.23 qps: 10014.23 (r/w/o: 0.00/10014.23/0.00) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 395s ] thds: 512 tps: 10765.59 qps: 10765.59 (r/w/o: 0.00/10765.59/0.00) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 512 tps: 10420.81 qps: 10421.21 (r/w/o: 0.00/10421.21/0.00) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 405s ] thds: 512 tps: 10276.76 qps: 10276.36 (r/w/o: 0.00/10276.36/0.00) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 410s ] thds: 512 tps: 10349.58 qps: 10349.58 (r/w/o: 0.00/10349.58/0.00) lat (ms,95%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 415s ] thds: 512 tps: 10328.35 qps: 10328.35 (r/w/o: 0.00/10328.35/0.00) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 512 tps: 10267.96 qps: 10267.96 (r/w/o: 0.00/10267.96/0.00) lat (ms,95%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 425s ] thds: 512 tps: 10221.39 qps: 10221.39 (r/w/o: 0.00/10221.39/0.00) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 430s ] thds: 512 tps: 9611.61 qps: 9611.61 (r/w/o: 0.00/9611.61/0.00) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 435s ] thds: 512 tps: 10474.08 qps: 10474.28 (r/w/o: 0.00/10474.28/0.00) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 512 tps: 10593.31 qps: 10593.11 (r/w/o: 0.00/10593.11/0.00) lat (ms,95%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 445s ] thds: 512 tps: 9860.62 qps: 9860.62 (r/w/o: 0.00/9860.62/0.00) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 450s ] thds: 512 tps: 10027.24 qps: 10027.24 (r/w/o: 0.00/10027.24/0.00) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 455s ] thds: 512 tps: 10366.81 qps: 10366.81 (r/w/o: 0.00/10366.81/0.00) lat (ms,95%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 512 tps: 9534.27 qps: 9534.27 (r/w/o: 0.00/9534.27/0.00) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 465s ] thds: 512 tps: 9812.49 qps: 9812.49 (r/w/o: 0.00/9812.49/0.00) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 470s ] thds: 512 tps: 9921.20 qps: 9921.20 (r/w/o: 0.00/9921.20/0.00) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 475s ] thds: 512 tps: 9922.24 qps: 9922.24 (r/w/o: 0.00/9922.24/0.00) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 512 tps: 9841.37 qps: 9841.37 (r/w/o: 0.00/9841.37/0.00) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 485s ] thds: 512 tps: 9645.07 qps: 9645.07 (r/w/o: 0.00/9645.07/0.00) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 490s ] thds: 512 tps: 9585.70 qps: 9585.70 (r/w/o: 0.00/9585.70/0.00) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 495s ] thds: 512 tps: 10352.68 qps: 10352.68 (r/w/o: 0.00/10352.68/0.00) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 512 tps: 9626.52 qps: 9626.52 (r/w/o: 0.00/9626.52/0.00) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 505s ] thds: 512 tps: 9551.72 qps: 9551.72 (r/w/o: 0.00/9551.72/0.00) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 510s ] thds: 512 tps: 9879.61 qps: 9879.61 (r/w/o: 0.00/9879.61/0.00) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 515s ] thds: 512 tps: 9412.11 qps: 9412.11 (r/w/o: 0.00/9412.11/0.00) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 512 tps: 9421.97 qps: 9421.97 (r/w/o: 0.00/9421.97/0.00) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 525s ] thds: 512 tps: 9886.85 qps: 9886.85 (r/w/o: 0.00/9886.85/0.00) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 530s ] thds: 512 tps: 9186.56 qps: 9186.56 (r/w/o: 0.00/9186.56/0.00) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 535s ] thds: 512 tps: 9635.08 qps: 9635.08 (r/w/o: 0.00/9635.08/0.00) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 512 tps: 9324.14 qps: 9324.14 (r/w/o: 0.00/9324.14/0.00) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 545s ] thds: 512 tps: 9290.07 qps: 9290.07 (r/w/o: 0.00/9290.07/0.00) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 550s ] thds: 512 tps: 9750.75 qps: 9750.75 (r/w/o: 0.00/9750.75/0.00) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 555s ] thds: 512 tps: 9645.54 qps: 9645.54 (r/w/o: 0.00/9645.54/0.00) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 512 tps: 9431.83 qps: 9431.83 (r/w/o: 0.00/9431.83/0.00) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 565s ] thds: 512 tps: 9303.22 qps: 9303.22 (r/w/o: 0.00/9303.22/0.00) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 570s ] thds: 512 tps: 10042.39 qps: 10042.39 (r/w/o: 0.00/10042.39/0.00) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 575s ] thds: 512 tps: 8960.18 qps: 8960.18 (r/w/o: 0.00/8960.18/0.00) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 512 tps: 9894.10 qps: 9894.10 (r/w/o: 0.00/9894.10/0.00) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 585s ] thds: 512 tps: 9284.79 qps: 9284.79 (r/w/o: 0.00/9284.79/0.00) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 590s ] thds: 512 tps: 9126.98 qps: 9126.98 (r/w/o: 0.00/9126.98/0.00) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 595s ] thds: 512 tps: 9262.20 qps: 9262.20 (r/w/o: 0.00/9262.20/0.00) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 512 tps: 9749.46 qps: 9749.46 (r/w/o: 0.00/9749.46/0.00) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 605s ] thds: 512 tps: 9097.66 qps: 9097.66 (r/w/o: 0.00/9097.66/0.00) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 610s ] thds: 512 tps: 9293.40 qps: 9293.20 (r/w/o: 0.00/9293.20/0.00) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 615s ] thds: 512 tps: 9262.89 qps: 9263.09 (r/w/o: 0.00/9263.09/0.00) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 620s ] thds: 512 tps: 9235.98 qps: 9235.98 (r/w/o: 0.00/9235.98/0.00) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 625s ] thds: 512 tps: 9229.96 qps: 9229.96 (r/w/o: 0.00/9229.96/0.00) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 630s ] thds: 512 tps: 8898.27 qps: 8898.27 (r/w/o: 0.00/8898.27/0.00) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 635s ] thds: 512 tps: 9324.47 qps: 9324.47 (r/w/o: 0.00/9324.47/0.00) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 640s ] thds: 512 tps: 9235.12 qps: 9235.12 (r/w/o: 0.00/9235.12/0.00) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 645s ] thds: 512 tps: 9124.98 qps: 9124.98 (r/w/o: 0.00/9124.98/0.00) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 650s ] thds: 512 tps: 8889.99 qps: 8889.99 (r/w/o: 0.00/8889.99/0.00) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 655s ] thds: 512 tps: 8726.21 qps: 8726.21 (r/w/o: 0.00/8726.21/0.00) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 660s ] thds: 512 tps: 9409.49 qps: 9409.49 (r/w/o: 0.00/9409.49/0.00) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 665s ] thds: 512 tps: 9078.12 qps: 9078.12 (r/w/o: 0.00/9078.12/0.00) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 670s ] thds: 512 tps: 8544.65 qps: 8544.65 (r/w/o: 0.00/8544.65/0.00) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 675s ] thds: 512 tps: 9163.57 qps: 9163.57 (r/w/o: 0.00/9163.57/0.00) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 680s ] thds: 512 tps: 9222.28 qps: 9222.48 (r/w/o: 0.00/9222.48/0.00) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 685s ] thds: 512 tps: 8591.29 qps: 8591.09 (r/w/o: 0.00/8591.09/0.00) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 690s ] thds: 512 tps: 8227.94 qps: 8227.94 (r/w/o: 0.00/8227.94/0.00) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 695s ] thds: 512 tps: 9377.47 qps: 9377.67 (r/w/o: 0.00/9377.67/0.00) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 700s ] thds: 512 tps: 8529.30 qps: 8529.10 (r/w/o: 0.00/8529.10/0.00) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 705s ] thds: 512 tps: 8817.15 qps: 8817.15 (r/w/o: 0.00/8817.15/0.00) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 710s ] thds: 512 tps: 8678.92 qps: 8679.12 (r/w/o: 0.00/8679.12/0.00) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 715s ] thds: 512 tps: 8356.66 qps: 8356.46 (r/w/o: 0.00/8356.46/0.00) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 720s ] thds: 512 tps: 8616.35 qps: 8616.35 (r/w/o: 0.00/8616.35/0.00) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 725s ] thds: 512 tps: 8761.76 qps: 8761.76 (r/w/o: 0.00/8761.76/0.00) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 730s ] thds: 512 tps: 8604.47 qps: 8604.47 (r/w/o: 0.00/8604.47/0.00) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 735s ] thds: 512 tps: 8345.23 qps: 8345.23 (r/w/o: 0.00/8345.23/0.00) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 740s ] thds: 512 tps: 8595.79 qps: 8595.79 (r/w/o: 0.00/8595.79/0.00) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 745s ] thds: 512 tps: 8759.29 qps: 8759.29 (r/w/o: 0.00/8759.29/0.00) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 750s ] thds: 512 tps: 8531.62 qps: 8531.82 (r/w/o: 0.00/8531.82/0.00) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 755s ] thds: 512 tps: 8565.95 qps: 8565.75 (r/w/o: 0.00/8565.75/0.00) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 760s ] thds: 512 tps: 8436.95 qps: 8436.95 (r/w/o: 0.00/8436.95/0.00) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 765s ] thds: 512 tps: 8296.31 qps: 8296.31 (r/w/o: 0.00/8296.31/0.00) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 770s ] thds: 512 tps: 8519.25 qps: 8519.25 (r/w/o: 0.00/8519.25/0.00) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 775s ] thds: 512 tps: 8268.40 qps: 8268.40 (r/w/o: 0.00/8268.40/0.00) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 780s ] thds: 512 tps: 8463.74 qps: 8463.74 (r/w/o: 0.00/8463.74/0.00) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           10000000
        other:                           0
        total:                           10000000
    transactions:                        10000000 (12798.32 per sec.)
    queries:                             10000000 (12798.32 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          781.3495s
    total number of events:              10000000

Latency (ms):
         min:                                  0.55
         avg:                                 40.00
         max:                               1106.30
         95th percentile:                    127.81
         sum:                            399975702.61

Threads fairness:
    events (avg/stddev):           19531.2500/224.74
    execution time (avg/stddev):   781.2025/0.05